month = int(input('Введите номер месяца от 1 до 12: '))


months = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']

print('Через список:', months[month - 1])


month_dict = {1: 'Зима', 2: 'Зима', 3: 'Весна', 4: 'Весна', 5: 'Весна', 6: 'Лето',
              7: 'Лето', 8: 'Лето', 9: 'Осень', 10: 'Осень', 11: 'Зима', 12: 'Зима'}

print('Через словарь:', month_dict.get(month))


seasons = {'Зима': [12, 1, 2], 'Весна': [3, 4, 5], 'Лето': [6, 7, 8], 'Осень': [9, 10, 11]}

for season in seasons:
    months_list = seasons.get(season)
    if month in months_list:
        print('Через словарь и список:', season)
        break
